var memberTypeData = {
    "C": "公司帳號",
    "S": "主管",
    "A": "管理員"
}
var companyTypeData = {
    "C": "公司帳號",
}
var SupervisorTypeData = {
    "S": "主管",
}


var GoOutWeekends = {
    0: "自行",
    1: "親友",
    2: "結伴",
    3: "不可",
    4: "輔導員帶",

}
var OvernightWeekends = {
    0: "親友",
    1: "結伴",
    2: "自行+結伴",
    3: "結伴+親友",
    4: "自行+親友",
    5: "自行+親友+結伴",
    6: "不可",
    7: "輔導員帶",

}
var GoOutWeekdays = {
    0: "自行",
    1: "親友",
    2: "結伴",
    3: "不可",
    4: "輔導員帶",
}
var CategoryA = {
    0: "聽力測驗-第一部分：看圖回答",
    1: "聽力測驗-第二部分：問答理解",
    2: "聽力測驗-第三部分：對話理解",
    3: "聽力測驗-第四部分：對話",
    4: "閱讀測驗-第一部分：單句理解",
    5: "閱讀測驗-第二部分：看圖釋義",
    6: "閱讀測驗-第三部分：選詞填空",
    7: "閱讀測驗-第四部分：完成段落",
    8: "閱讀測驗-第五部分：閱讀理解",

}

var CategoryB= {
    0: "聽力測驗-第一部分：對話",
    1: "聽力測驗-第二部分：段落",
    2: "閱讀測驗-第一部分：選詞填空",
    3: "閱讀測驗-第二部分：閱讀理解",
}

var CategoryC= {
    0: "聽力測驗-第一部分：對話（單）",
    1: "聽力測驗-第一部分：對話（組）",
    2: "聽力測驗-第二部分：段落（單）",
    3: "聽力測驗-第二部分：段落（組）",
    4: "閱讀測驗-第一部分：選詞填空",
    5: "閱讀測驗-第二部分：閱讀理解",
}
var ThemeData = {
    0: "個人資料與家庭",
    1: "日常生活",
    2: "購物與商業行為",
    3: "飲食與文化",
    4: "居住與環境",
    5: "休閒與娛樂",
    6: "旅行與交通",
    7: "生活時尚",
    8: "教育與學習",
    9: "健康與身體照護",
    10: "人際關係",
    11: "工作與社會",
    12: "科技與創新",
    13: "節慶與習俗",
    14: "歷史與人文",
    15: "地理與國際眺望",
    16: "其他",
 
}
var languageData = {
    0: "華語",
    1: "英語",
    2: "日語",
    3: "韓語",
    4: "越南語",
    5: "泰語",
    6: "法語",
    7: "俄語",
    8: "西班牙語",
    9: "印尼語"
}

var SchoolData = {
    2: "管理員",
    3: "淡江大學華語中心",
    4: "慈濟大學華語中心",
    5: "中原大學華語文教學中心",
    6: "文藻外語大學華語中心",
    7: "國立台北教育大學華語文中心",
    8: "國立政治大學華語文教學中心",
    9: "逢甲大學華語中心",
    10: "中國文化大學華語中心",
    11: "世新大學華語文教學中心",
    12: "佛光大學國際暨兩岸事務處華語教學中心",
    13: "東吳大學華語教學中心",
    14: "長榮大學華語文教育中心",
    15: "南華大學華語中心",
    16: "國立屏東大學語言中心華語組",
    18: "國立勤益科技大學語言中心",
    19: "國立嘉義大學 語言中心華語組",
    20: "國立彰化師範大學語文中心華語文組",
    21: "國立臺灣海洋大學華語中心",
    22: "國立聯合大學華語文中心",
    23: "崑山科技大學華語中心",
    24: "景文科技大學華語文教學中心",
    25: "實踐大學華語中心",
    26: "輔仁大學華語文中心",
    27: "銘傳大學華語訓練中心",
    28: "樹德科技大學語文暨國際教學中心華語教學組",
    29: "靜宜大學華語文教學中心",
    30: "國立暨南國際大學華語文教學碩士學位學程",
    31: "國立東華大學華語中心",

}